[
  {
    "date":1456195957459,
    "platform":"google",
    "text":"(Translated by Google) Love park\nA delicious place to read a book\nWithout being robbed or shot\nIt would be nice if the liberty bell stood beside him\n\n(Original)\nLove park\nUm lugar delicioso pra ler um livro\nSem ser roubado ou sem levar um tiro\nSeria legal se o sino da liberdade ficasse ao lado dele"
  },
  {
    "date":1457637445000,
    "platform":"google",
    "text":"Smaller than I thought, but awesome sight"
  },
  {
    "date":1457907348109,
    "platform":"google",
    "text":"One of the most iconic things about Philadelphia. For now it has been relocated but will be back in Love Park by spring 2016."
  },
  {
    "date":1459438385950,
    "platform":"google",
    "text":"(Translated by Google) A monument a bit silly, also the night area is a bit dangerous.\n\n(Original)\nUn monumento un poco tontorrón, además la zona de noche es un poco peligrosa."
  },
  {
    "date":1460139019280,
    "platform":"google",
    "text":"Going to Love Park, Arch St, Philadelphia, PA 19102 was nice on a walk around center city Philly. Quite a few locals trying to ask you to pay them to take your photo with your camera. Not ideal if you ask me I declined."
  },
  {
    "date":1460075303720,
    "platform":"google",
    "text":"So touristy but a definite must go in Philadelphia. Great sign for people to take your picture. Just use caution who you ask to take your photo as there have been instances of people running off with the camera."
  },
  {
    "date":1460685621565,
    "platform":"google",
    "text":"Quite touristy, but touristy for a reason. A must for any visitors to Philadelphia."
  },
  {
    "date":1462680566378,
    "platform":"google",
    "text":"Quite possibly the greatest  statue I've ever seen in my entire life"
  },
  {
    "date":1463091731009,
    "platform":"google",
    "text":"The sculpture is tiny and forgettable. So walk past it and look at absolutely anything else. The area is beautiful, just not this statue."
  },
  {
    "date":1463444709391,
    "platform":"google",
    "text":"do you have to like pay to see this or is this thing just in the street?"
  },
  {
    "date":1466945193811,
    "platform":"google",
    "text":"The most touristy and iconic photo of Philly on the Parkway. Statue has been relocated diagonal from the park at Dilworth Park until the renovations of Love Park are complete."
  },
  {
    "date":1468592769726,
    "platform":"google",
    "text":"A great place to meet someone.  Love Sculpture has been moved to Dilworth Plaza temporarily."
  },
  {
    "date":1468807505114,
    "platform":"google",
    "text":"One of the few LOVE sculptures in the world, but the view around it at the time wasn't good due to some apparent construction work."
  },
  {
    "date":1468865280358,
    "platform":"google",
    "text":"Strike a heart shape pose in front of it with the one you love."
  },
  {
    "date":1469654361351,
    "platform":"google",
    "text":"The heart of the city."
  },
  {
    "date":1469969172605,
    "platform":"google",
    "text":"very beautiful place"
  },
  {
    "date":1470152403559,
    "platform":"google",
    "text":"Beautiful sculpture."
  },
  {
    "date":1470496155526,
    "platform":"google",
    "text":"romantic spot"
  },
  {
    "date":1470580160503,
    "platform":"google",
    "text":"I must say I thought it'd be bigger but it was still nice."
  },
  {
    "date":1472475337691,
    "platform":"google",
    "text":"(Translated by Google) In restoration when we went there in August 2016. So nothing to see. No problem, we saw the same in NY ...\n\n(Original)\nEn restauration quand nous y sommes allé en aout 2016. Du coup rien à voir. Pas grave, on a vu la même à NY..."
  },
  {
    "date":1473818008365,
    "platform":"google",
    "text":"(Translated by Google) It didn't catch the rain!\n\n(Original)\n下雨沒拍到！"
  },
  {
    "date":1474897728081,
    "platform":"google",
    "text":"Found it to be hyped."
  },
  {
    "date":1476188860351,
    "platform":"google",
    "text":"Great an beautiful place to go"
  },
  {
    "date":1476286799357,
    "platform":"google",
    "text":"Nice little park and sculpture but lots of people in the area pestering you."
  },
  {
    "date":1477878486305,
    "platform":"google",
    "text":"(Translated by Google) There are homeless people and the monument is not so big\n\n(Original)\nHay indigentes y el monumento no es tan grande"
  },
  {
    "date":1478000344237,
    "platform":"google",
    "text":"Such an amazing spot to take your family from out of town. We got way too many pictures and it's pretty easy to spot from a car."
  },
  {
    "date":1479159655858,
    "platform":"google",
    "text":"Lots of people"
  },
  {
    "date":1480298373265,
    "platform":"google",
    "text":"Very classic and timeless.  Iconic"
  },
  {
    "date":1482184012660,
    "platform":"google",
    "text":"(Translated by Google) the most famous park of love with the equally famous sculpture \"LOVE\"\n\n(Original)\nnajsłynniejszy park miłości z równie słynną rzeźbą \"LOVE\""
  },
  {
    "date":1483597919601,
    "platform":"google",
    "text":"Currently closed for renovation. Find the sign diagonally across at Dilworth Park (right by the City Hall)."
  },
  {
    "date":1485228977322,
    "platform":"google",
    "text":"THE place to get a photo in Philly.  Currently moved across the street due to reconstruction of the park."
  },
  {
    "date":1485791535183,
    "platform":"google",
    "text":"We visited it when it was behind the city hall! Definitely a great thing to do when visiting Philly."
  },
  {
    "date":1487731536180,
    "platform":"google",
    "text":"So touristy it hurts, but it's iconic"
  },
  {
    "date":1487767023571,
    "platform":"google",
    "text":"Peak Philly"
  },
  {
    "date":1488012945298,
    "platform":"google",
    "text":"Ok it didn't tell that they were doing renovations on it."
  },
  {
    "date":1488815847091,
    "platform":"google",
    "text":"perfect spot for couples"
  },
  {
    "date":1489413311035,
    "platform":"google",
    "text":"(Translated by Google) Hey, I moved this\n\n(Original)\n야 이거 옮겼어 ㅡㅡ 어이가 없네"
  },
  {
    "date":1491277578364,
    "platform":"google",
    "text":"we will miss you love park R.I.P"
  },
  {
    "date":1492380469484,
    "platform":"google",
    "text":"The love sculpture is not there. The park is currently under renovation and the sculpture has been removed. It should be back in place in September 2017. If you really want to see a LOVE sign, there is a replica (I'm guessing it's smaller, but I didn't get to see the real one) on the U Penn campus across from the Sweeten Alumni House."
  },
  {
    "date":1495510911164,
    "platform":"google",
    "text":"(Translated by Google) Very beautiful sculpture that attracts photographers. A symbol of Philadelphia.\n\n(Original)\nTrès belle sculpture qui attire les photographes.  Un symbole de Philadelphie."
  },
  {
    "date":1500162651111,
    "platform":"google",
    "text":"Going to Philadelphia has always been on my bucket list. One of my first stops while in the City of Brotherly Love was of course the famous LOVE Park and it's Love Sign! The park is very mentally located to other tourist attraction live Independence Hall, Benjamin Franklin Museum, Franklin Square, etc. Definitely worth stopping by."
  },
  {
    "date":1501791801813,
    "platform":"google",
    "text":"(Translated by Google) Very pretty\n\n(Original)\nMuy bonito"
  },
  {
    "date":1501867556651,
    "platform":"google",
    "text":"Under construction....til Oct"
  },
  {
    "date":1502668774982,
    "platform":"google",
    "text":"It's nice to take pictures at love park, local attractions include Philly Jesus."
  },
  {
    "date":1503267921890,
    "platform":"google",
    "text":"Used to be an historical place to sit,talk take photos listen to the water fall or watch the skate board boy's. Waiting for the \"Come back\""
  },
  {
    "date":1503289472079,
    "platform":"google",
    "text":"Sexy"
  },
  {
    "date":1503607957736,
    "platform":"google",
    "text":"Unfortunately under construction at the moment."
  },
  {
    "date":1504060449983,
    "platform":"google",
    "text":"I'm in the family we love to go there so nice out in for the family"
  },
  {
    "date":1505210673260,
    "platform":"google",
    "text":"nice art work"
  },
  {
    "date":1505862086071,
    "platform":"google",
    "text":"Love love park"
  },
  {
    "date":1505835797329,
    "platform":"google",
    "text":"Nothing there"
  },
  {
    "date":1505914482000,
    "platform":"google",
    "text":"Love park is closed now for construction. It will open in 2018. Waiting to see the new look of love park."
  },
  {
    "date":1506097704566,
    "platform":"google",
    "text":"Love park is being renovated.  There is no access to the park.  Its closed off."
  },
  {
    "date":1506907362265,
    "platform":"google",
    "text":"It was such a beautiful area before, now under construction till 2018. We'll see how it looks after. All these people giving 1 star reviews because they are renovating it is foolish and idiotic......"
  },
  {
    "date":1506992452724,
    "platform":"google",
    "text":"Beautiful  love this place"
  },
  {
    "date":1507366067246,
    "platform":"google",
    "text":"Its currently under construction when it was open alot of people hungout there mostly folks that didn't have a place to stay i think once its reopened again that will change its sad that these so-called leaders of the community don't care to try and help the homeless"
  },
  {
    "date":1507839877671,
    "platform":"google",
    "text":"Need to clear out the druggies and bums.Need better access to cleaner safer bathrooms and entrances and exits to public transportation"
  },
  {
    "date":1509048293703,
    "platform":"google",
    "text":"WHEN THERE WAS A LOVE PARK IT WAS BEAUTIFUL. LOTS OF FUN FOR THE OLD AND YOUNG.THERE'S NO MORE LOVE PARK AT THIS TIME. 😥"
  },
  {
    "date":1509045411697,
    "platform":"google",
    "text":"Outdoors for some great place to meet up with friend but still under constuction"
  },
  {
    "date":1509570265690,
    "platform":"google",
    "text":"Currently in renovation...missed it"
  },
  {
    "date":1510018817319,
    "platform":"google",
    "text":"Love statue was under renovations"
  },
  {
    "date":1510030764805,
    "platform":"google",
    "text":"Good"
  },
  {
    "date":1510055091834,
    "platform":"google",
    "text":"Horrible"
  },
  {
    "date":1510259634967,
    "platform":"google",
    "text":"Simple and convenient parking lot. Pricing is comparable to what's around."
  },
  {
    "date":1511622599316,
    "platform":"google",
    "text":"I love this park"
  },
  {
    "date":1511744215463,
    "platform":"google",
    "text":"Not really a review of love park because it is not finished construction yet but of the use of the park for the Christmas Village with the park not finished. Lots of vendors but to many choke points caused by the ongoing construction. It would have been better to do another year around city hall they use love park to early."
  },
  {
    "date":1511741838644,
    "platform":"google",
    "text":"Was here for the christmas market. Love the warm mulled wine ans the kathe shop. Feels just like the German christmas markets. Nice selection of shops and food. Great place to add to your christmas visit to center city. The strudel shop is a must stop."
  },
  {
    "date":1511748538869,
    "platform":"google",
    "text":"(Translated by Google) Good romantic place\n\n(Original)\nBuen lugar romantico"
  },
  {
    "date":1511887994733,
    "platform":"google",
    "text":"Still under construction but getting closer. Hopefully it will be as nice as the Dilworth Park renovation."
  },
  {
    "date":1511893347776,
    "platform":"google",
    "text":"Very nice"
  },
  {
    "date":1511909824674,
    "platform":"google",
    "text":"Only 1 way in to Christmas village and 6 feet of walkway. Downright dangerous and overcrowded"
  },
  {
    "date":1511840584072,
    "platform":"google",
    "text":"Always a great time"
  },
  {
    "date":1511902614355,
    "platform":"google",
    "text":"Good place"
  },
  {
    "date":1511885613592,
    "platform":"google",
    "text":"Nice place"
  },
  {
    "date":1511914172986,
    "platform":"google",
    "text":"I'm seeing the Potential of the New Love Park, Spring will be the defining moment."
  },
  {
    "date":1511926492118,
    "platform":"google",
    "text":"Nice place"
  },
  {
    "date":1511941015947,
    "platform":"google",
    "text":"Just your dull average park. No biggie."
  },
  {
    "date":1512178358292,
    "platform":"google",
    "text":"The Christkindlemarkt was lots of fun and had authentic stalls just like in the big Christmas markets in Germany."
  },
  {
    "date":1512268771138,
    "platform":"google",
    "text":"Although Love Park is currently  undergoing  refurbishment  depending  on when you read this review,  it is a spectacular  place to visit  in Philadelphia  .  During the holiday  season  it is transformed  into Christmas  Village , which  is also a remarkable  spectacle  in of itself  . You can't  go wrong with Love Park  ."
  },
  {
    "date":1512334938612,
    "platform":"google",
    "text":"Great experience shopping there it is a lot of little shops"
  },
  {
    "date":1512514154951,
    "platform":"google",
    "text":"It's back up and running with Christmas Village. Can't wait until construction is completely finished."
  },
  {
    "date":1512480902595,
    "platform":"google",
    "text":"Annual Kristkindl Markt"
  },
  {
    "date":1512503938628,
    "platform":"google",
    "text":"Poor review because it's always under construction. Went there on opening day of the Christmas festival. Highly disappointing. Too much foot traffic to fit throuth narrow walking paths. Not an enjoyale experiennce. Didn't see the love statue, which is where I got engaged. Construction needs to be finished."
  },
  {
    "date":1512471749190,
    "platform":"google",
    "text":"A nice little Christmas village"
  },
  {
    "date":1512441851457,
    "platform":"google",
    "text":"There's music food and little shops"
  },
  {
    "date":1512678591364,
    "platform":"google",
    "text":"Great place to visit.  Christmas markets and lights."
  },
  {
    "date":1512671552905,
    "platform":"google",
    "text":"Very nice"
  },
  {
    "date":1512703474861,
    "platform":"google",
    "text":"Nice clean, brand new. Xmas village looks great. No skateboarders to ruin your night"
  },
  {
    "date":1512737083111,
    "platform":"google",
    "text":"It's a park with nothing to do"
  },
  {
    "date":1512779613585,
    "platform":"google",
    "text":"Nice Christmas display"
  },
  {
    "date":1512853160450,
    "platform":"google",
    "text":"Beautiful!"
  },
  {
    "date":1512950327424,
    "platform":"google",
    "text":"Nice setting"
  },
  {
    "date":1512908488927,
    "platform":"google",
    "text":"No sign. No tree. No fun."
  },
  {
    "date":1512997213869,
    "platform":"google",
    "text":"Lively place."
  },
  {
    "date":1513002656434,
    "platform":"google",
    "text":"Christmas Village was there while under construction."
  },
  {
    "date":1513120669505,
    "platform":"google",
    "text":"The German market during Christmas season is a great time to visit and you can cross the street to City Hall and ice skate"
  },
  {
    "date":1513110084299,
    "platform":"google",
    "text":"Hard to get around with the construction. Spent most of the time trying to maneuver around people."
  },
  {
    "date":1513286293351,
    "platform":"google",
    "text":"Always a wonderful experience."
  },
  {
    "date":1513277845098,
    "platform":"google",
    "text":"Permanently closed"
  },
  {
    "date":1513229407855,
    "platform":"google",
    "text":"Great place"
  },
  {
    "date":1513342342118,
    "platform":"google",
    "text":"RIP Philly lost it's Love."
  },
  {
    "date":1513359453289,
    "platform":"google",
    "text":"Love the Christmas German village"
  },
  {
    "date":1513382617520,
    "platform":"google",
    "text":"Went here for the Christmas village. It was snowing but still a good time. The bratwurst was great. Wish the love park statue was up."
  },
  {
    "date":1513436772296,
    "platform":"google",
    "text":"Iconic Philly centerpiece. No longer overshadowed by Dilworth, the new renovations bring this place into the next decade"
  },
  {
    "date":1513458024112,
    "platform":"google",
    "text":"It is so festive for the holidays"
  },
  {
    "date":1513441426038,
    "platform":"google",
    "text":"Love Christmas Village"
  },
  {
    "date":1513509550611,
    "platform":"google",
    "text":"Finish the project.  Then review will improve"
  },
  {
    "date":1513603235855,
    "platform":"google",
    "text":"Unfortunately the statue at love park has been removed for repairs until 2018. Right now there is a Christmas Village in its place."
  },
  {
    "date":1513567701145,
    "platform":"google",
    "text":"Awesome. Need Love sign back"
  },
  {
    "date":1513725839555,
    "platform":"google",
    "text":"The Christmas village was absolutely beautiful even in the daytime.  We arrived and shortly after it began to snow, very magical.  And the brats and pretzels were amazing."
  },
  {
    "date":1513691226960,
    "platform":"google",
    "text":"Other than falling on ice and Christmas Villages being way over priced it is nice to browse"
  },
  {
    "date":1513804773944,
    "platform":"google",
    "text":"It's LOVE.park. of course it's good!"
  },
  {
    "date":1513778209892,
    "platform":"google",
    "text":"Loved the Christmas Village and great activities."
  },
  {
    "date":1513804939845,
    "platform":"google",
    "text":"Nice to see at Christmas time."
  },
  {
    "date":1513780171311,
    "platform":"google",
    "text":"NICE"
  },
  {
    "date":1513731296348,
    "platform":"google",
    "text":"Must see and take a picture"
  },
  {
    "date":1513888833503,
    "platform":"google",
    "text":"The new park renovations are awesome!"
  },
  {
    "date":1513861041806,
    "platform":"google",
    "text":"There for the Christmas mart but couldn't find the love sculture!"
  },
  {
    "date":1513917604289,
    "platform":"google",
    "text":"Great place to be. Especially for the Christmas Village. Love Park was recently renovated."
  },
  {
    "date":1513954074112,
    "platform":"google",
    "text":"(Translated by Google) Nice park but it has been under construction for a long time\n\n(Original)\nParque bonito pero está de obras desde hace tiempo"
  },
  {
    "date":1514038762349,
    "platform":"google",
    "text":"This was my first visit to love park and the Christmas village was open, it was great I loved it they had tons of gifts from all over the world, this wasn't your typical craft show with the same old junk that you see everywhere. I got some really great gifts and some great food as well. I will make the trip next year for sure."
  },
  {
    "date":1514045651359,
    "platform":"google",
    "text":"Wonderful time getting into the Christmas spirit"
  },
  {
    "date":1514024809720,
    "platform":"google",
    "text":"Very disappointed with love park. .Shops are supposed to be open till 8:00..90precen of them were closed by 7:15..."
  },
  {
    "date":1514056881974,
    "platform":"google",
    "text":"Under construction"
  },
  {
    "date":1514026709239,
    "platform":"google",
    "text":"Beautiful"
  },
  {
    "date":1514042857890,
    "platform":"google",
    "text":"They need to hurry up and finish the construction"
  },
  {
    "date":1514119288921,
    "platform":"google",
    "text":"The Christmas Village is amazing. If you don't visit this year be sure to do so next year. There's something for everyone. It opens right after Thanksgiving."
  },
  {
    "date":1514168222608,
    "platform":"google",
    "text":"Great to to see the Christmas village back in Love Park. The restorations are almost complete. Great atmosphere and shops setup. Plenty of merchants selling lots items from local small businesses.  Great food and drink. The German Shop of Christmas ornaments is something you have to visit when there."
  },
  {
    "date":1514323011723,
    "platform":"google",
    "text":"Peddlers Village was awesome for the children"
  },
  {
    "date":1514407631233,
    "platform":"google",
    "text":"Awesome! Except for parking ... take the train!"
  },
  {
    "date":1514337578226,
    "platform":"google",
    "text":"Another Philadelphia construction project. Over budget. Over deadline. Underwhelming"
  },
  {
    "date":1514511260484,
    "platform":"google",
    "text":"Excellent Experience"
  },
  {
    "date":1514551760240,
    "platform":"google",
    "text":"Our Christmas go to spot"
  },
  {
    "date":1514655467032,
    "platform":"google",
    "text":"Went here to enjoy the German Christmas Market, it really was beautiful! There was traditional food to eat and many different  cultures that intermingled. Tons of unique gifts to buy, I loved it."
  },
  {
    "date":1514665682413,
    "platform":"google",
    "text":"LOVED THE CHRISTMAS VILLAGE 2017"
  },
  {
    "date":1514787218539,
    "platform":"google",
    "text":"Love this place... But for now is closed for construction 🚧\nBy chance I found someone wrote this on the wall of some building right across the park 🏞. Check the pic so funny though"
  },
  {
    "date":1514820524045,
    "platform":"google",
    "text":"Just passed though look ok."
  },
  {
    "date":1514951681555,
    "platform":"google",
    "text":"Visited Love Park during the annual Philadelphia Festival"
  },
  {
    "date":1515025365415,
    "platform":"google",
    "text":"Nice all year round but especially near Christmas with all the shops and events."
  },
  {
    "date":1515119997671,
    "platform":"google",
    "text":"Beautiful place except for all the homeless people"
  },
  {
    "date":1515275920371,
    "platform":"google",
    "text":"Christmas Village was delightful as usual, even with the under construction dilemma. Looking forward to next year."
  },
  {
    "date":1515197144578,
    "platform":"google",
    "text":"Nice park in center city!"
  },
  {
    "date":1515332857924,
    "platform":"google",
    "text":"Must visit christmas village. Variety of small stalls"
  },
  {
    "date":1515352932045,
    "platform":"google",
    "text":"Crowded"
  },
  {
    "date":1515521513809,
    "platform":"google",
    "text":"Beautiful all year, but a visit to the winter Christmas Village is a must for Philly natives and visitors!"
  },
  {
    "date":1515589890471,
    "platform":"google",
    "text":"Across the street from City Hall"
  },
  {
    "date":1515672008703,
    "platform":"google",
    "text":"Quaint and charming, loved Love Park"
  },
  {
    "date":1515769958668,
    "platform":"google",
    "text":"Philly's own tradition -- Christmas Festival at Love Park!!"
  },
  {
    "date":1515856000444,
    "platform":"google",
    "text":"Love it!"
  },
  {
    "date":1516102062319,
    "platform":"google",
    "text":"I always love visiting love park. I never miss the holiday village. Going into town is always fun day\/ night out."
  },
  {
    "date":1516207964726,
    "platform":"google",
    "text":"Enjoyed the holiday stores, great place to visit with the family and just walk around, even if it is crowded."
  },
  {
    "date":1516307277858,
    "platform":"google",
    "text":"Christmas village"
  },
  {
    "date":1516552375288,
    "platform":"google",
    "text":"Proud to have this sculpture and park in my city."
  },
  {
    "date":1516573513266,
    "platform":"google",
    "text":"fun place"
  },
  {
    "date":1516596374983,
    "platform":"google",
    "text":"I don't enjoy Pennsylvania! Because I was accused of a crime that I didn't commit.  I spent 3 months in Montgomery County Prison.  I'm not even a resident of that state!  The Justice system is corrupt and I have not been able to recover.  My life was stolen from me due to the actions of a misinformed judge and a lying whitemarsh police officer!"
  },
  {
    "date":1516841180131,
    "platform":"google",
    "text":"The word love says it all"
  },
  {
    "date":1517067763762,
    "platform":"google",
    "text":"I simply love this place especially at Christmas time."
  },
  {
    "date":1517235899474,
    "platform":"google",
    "text":"Recently reconstructed to be safer and even more beautiful than before.  Love park is a great place to have pictures taken, weither you are visiting or a local.  You can see a lot of the great perks Philly has to offer from Love Park.  Especially great during the Christmas season when Christmas Village is there."
  },
  {
    "date":1517260953683,
    "platform":"google",
    "text":"Iconic Philly location"
  },
  {
    "date":1517368435783,
    "platform":"google",
    "text":"HAVE MANY MEMORIES HERE.. LOVED THIS PARK.. HOWEVER NOW IT LACKS THAT LOVE.. THAT IT HAD BEFORE.. I KNOW IT'S STILL UNDER CONSTRUCTION. SO IM HOPEFUL THINGS WILL IMPROVE DRASTICALLY.. TIME WILL TELL.."
  },
  {
    "date":1517426849657,
    "platform":"google",
    "text":"Holiday market was disappointing.  Many non-seasonal, cheap items for sale."
  },
  {
    "date":1517367340427,
    "platform":"google",
    "text":"Good for tours"
  },
  {
    "date":1517427937450,
    "platform":"google",
    "text":"Nothing to love here"
  },
  {
    "date":1517365465865,
    "platform":"google",
    "text":"We were engaged here!! Special place!!"
  },
  {
    "date":1517513946276,
    "platform":"google",
    "text":"Love"
  },
  {
    "date":1517702943911,
    "platform":"google",
    "text":"Christmas Village was worth the trip"
  },
  {
    "date":1518115728691,
    "platform":"google",
    "text":"Christmas Village is always worth the trip."
  },
  {
    "date":1518134837977,
    "platform":"google",
    "text":"Nothing was there. I was there in November too and thought they were doing construction. The park was empty this time. I took my sister so she could see it."
  },
  {
    "date":1518172990214,
    "platform":"google",
    "text":"Very relaxing place"
  },
  {
    "date":1518226658668,
    "platform":"google",
    "text":"While we were here the \"love\" sign was taken down due to renovation! A bit disappointing."
  },
  {
    "date":1518270364750,
    "platform":"google",
    "text":"Eagles Superbowl Parade"
  },
  {
    "date":1518377068096,
    "platform":"google",
    "text":"I LOVE YOUR CITY"
  },
  {
    "date":1518432785743,
    "platform":"google",
    "text":"Love park. Nothing else to say. Got to visit the city"
  },
  {
    "date":1518442555286,
    "platform":"google",
    "text":"Better than ever holiday vendor bazaar"
  },
  {
    "date":1518425338609,
    "platform":"google",
    "text":":-\\"
  },
  {
    "date":1518445562480,
    "platform":"google",
    "text":"(Translated by Google) A beautiful place to visit and take lots of photos.\n\n(Original)\nUn lugar hermoso para visitar y tomar muchas fotos."
  },
  {
    "date":1518527165165,
    "platform":"google",
    "text":"One Philadelphia beautiful places to visit when your here"
  },
  {
    "date":1518552080224,
    "platform":"google",
    "text":"the LOVE is Awesome!"
  },
  {
    "date":1518503494124,
    "platform":"google",
    "text":"Goooo EAGLES\/ parade 2018"
  },
  {
    "date":1518558915950,
    "platform":"google",
    "text":"Greatest Eagles Victory"
  },
  {
    "date":1518547610427,
    "platform":"google",
    "text":"Photographers Dream"
  },
  {
    "date":1518521402270,
    "platform":"google",
    "text":"Awesome"
  },
  {
    "date":1518612570888,
    "platform":"google",
    "text":"It's a magical place at certain times today"
  },
  {
    "date":1518632661536,
    "platform":"google",
    "text":"Great public space"
  },
  {
    "date":1518621668453,
    "platform":"google",
    "text":"Wish it still had the statue 😣"
  },
  {
    "date":1518666104832,
    "platform":"google",
    "text":"I will come back to update this review once the renovation is completed. I'm not sure what the park is now, though. Currently, it's mostly just a concrete slab taking up a block. There appears to be a lack of  greenery, trees, seating, and architectural intrigue (outside of oddly-placed steps). The Love statue returned, but it just feels like it was plopped down near its original location."
  },
  {
    "date":1518734176232,
    "platform":"google",
    "text":"Under construction during the Eagles super bowl parade."
  },
  {
    "date":1518808046974,
    "platform":"google",
    "text":"Love it, love it, love it!"
  },
  {
    "date":1518788223770,
    "platform":"google",
    "text":"EAGLES PARADE!"
  },
  {
    "date":1518874863240,
    "platform":"google",
    "text":"Went for the holiday markets. It's nice to go and enjoy all the unique food and products from local,national and international vendors.  It's an American version of a European Christmas Village or Holiday Market."
  },
  {
    "date":1518879620250,
    "platform":"google",
    "text":"Great historical park"
  },
  {
    "date":1518868391845,
    "platform":"google",
    "text":"Come visit Philadelphia"
  },
  {
    "date":1518904723592,
    "platform":"google",
    "text":"Charming place"
  },
  {
    "date":1519002195190,
    "platform":"google",
    "text":"It was lovely used to go there every day on lunch and rea"
  },
  {
    "date":1518999487686,
    "platform":"google",
    "text":"Great park . Nice with the small shops"
  },
  {
    "date":1519156079023,
    "platform":"google",
    "text":"A gorgeous day to see the LOVE statue back in place after being gone for a while!"
  },
  {
    "date":1519133987742,
    "platform":"google",
    "text":"Doing the Eagle parade."
  },
  {
    "date":1519175500312,
    "platform":"google",
    "text":"It's great for photography. It's one of my favorite places to shoot"
  },
  {
    "date":1519231468210,
    "platform":"google",
    "text":"NICE Nice nice YES Yes yes THANKS TO GOD FOR THE LIVING GOD up grade!"
  },
  {
    "date":1519172964132,
    "platform":"google",
    "text":"Looking better lots of improvement"
  },
  {
    "date":1519234801815,
    "platform":"google",
    "text":"They have transformed it into a sterile, uninviting public space that only exists so that tourists can take pictures of the sculpture. There is not even a bench to sit in. A tremendous loss to the city."
  },
  {
    "date":1519332469461,
    "platform":"google",
    "text":"Nice place to take photos"
  },
  {
    "date":1519332189709,
    "platform":"google",
    "text":"Eagles Parade..... Off The Hook!"
  },
  {
    "date":1519398257552,
    "platform":"google",
    "text":"Fun place to chill"
  },
  {
    "date":1519444054671,
    "platform":"google",
    "text":"Love is back. Where is should be, in the center of our beautiful Center City,  Philadelphia."
  },
  {
    "date":1519439961174,
    "platform":"google",
    "text":"Beautiful after renovations. Great spot for a walk"
  },
  {
    "date":1519502180009,
    "platform":"google",
    "text":"Great being with my union brothers and sisters."
  },
  {
    "date":1519504647017,
    "platform":"google",
    "text":"Very good"
  },
  {
    "date":1519451080272,
    "platform":"google",
    "text":"It was fun"
  },
  {
    "date":1519525828451,
    "platform":"google",
    "text":"Wonderful surprise by city hall.....  City of brotherly and all love"
  },
  {
    "date":1519644763743,
    "platform":"google",
    "text":"The Food was Great"
  },
  {
    "date":1519676027453,
    "platform":"google",
    "text":"Go visit ,,,,take a picture"
  },
  {
    "date":1519681637842,
    "platform":"google",
    "text":"(Translated by Google) Great landmark, be sure to stop and take a picture when you come. LOVE is smaller than expected ~ Parking is extravagant! The Franklin Street next to it is very beautiful and unique!\n\n(Original)\n很棒的的地标，来的话是一定要停下拍个照的。LOVE比想象的小～ 停车是奢侈的！旁边的富兰克林大街非常漂亮很有特色！"
  },
  {
    "date":1519749369230,
    "platform":"google",
    "text":"What an experience\\it been awhile"
  },
  {
    "date":1519765554710,
    "platform":"google",
    "text":"Bleak, barren, and utterly devoid of character. This is what the world will look like after the corporate apocalypse."
  },
  {
    "date":1519847551163,
    "platform":"google",
    "text":"Beautiful and Zesty place. There is something different about Downtown Philly. It's a beautiful place with beautiful people."
  },
  {
    "date":1519780369760,
    "platform":"google",
    "text":"One of the most beautiful parks in center city..."
  },
  {
    "date":1519827679552,
    "platform":"google",
    "text":"Its getting better each year!"
  },
  {
    "date":1519853686355,
    "platform":"google",
    "text":"sweet place"
  },
  {
    "date":1519875309444,
    "platform":"google",
    "text":"Take lovely pic"
  },
  {
    "date":1519864921530,
    "platform":"google",
    "text":"Fly Eagles Fly,!!"
  },
  {
    "date":1519989656819,
    "platform":"google",
    "text":"Beautiful place"
  },
  {
    "date":1520086861790,
    "platform":"google",
    "text":"It was nice during the December month they had the little Santa Claus shops and you can order different items from them"
  },
  {
    "date":1520036065825,
    "platform":"google",
    "text":"Beautiful park"
  },
  {
    "date":1520197395993,
    "platform":"google",
    "text":"Not what it use to be"
  },
  {
    "date":1520181462914,
    "platform":"google",
    "text":"(Translated by Google) The Love Plaza got the nickname \"LOVE Park\" thanks to the famous sculpture \"LOVE\" which was loaned to the city of Philadelphia in 1976 by the artist Robert Indiana to celebrate the bicentenary of the nation. Previously the square was known as JFK Plaza.\n\nRobert Indiana grew up in a Christian Science Church and from his religious roots he took inspiration for his famous work of art. Despite this statue is found a bit in many squares around the world, the photo under the original written LOVE is one of those photographic souvenirs to take home!\n\n(Original)\nThe Love Plaza ha ottenuto il soprannome di “LOVE Park” grazie alla famosa scultura “LOVE” che è stata prestata alla città di Philadelphia nel 1976 dall’artista Robert Indiana per celebrare il Bicentenario della nazione. Prima la piazza era conosciuta come JFK Plaza.\n\nRobert Indiana è cresciuto in una Christian Science Church e dalle sue radici religiose ha preso ispirazione per la sua celebre opera d’arte. Nonostante questa statua si trova un po’ in tante piazze del mondo, la foto sotto l’originale scritta LOVE è uno di quei souvenir fotografici da portare a casa!"
  },
  {
    "date":1520227807641,
    "platform":"google",
    "text":"Went there long time back. It seems now it is under renovation. At that time it was a small park with famous Love symbol. It's good for taking pictures."
  },
  {
    "date":1520209392430,
    "platform":"google",
    "text":"Love sign is under construction so there is a smaller one you can step into. There's street parking on the side."
  },
  {
    "date":1520354052009,
    "platform":"google",
    "text":"Love park is one of my favorite places in Philly. I used to eat lunch there and really missed it when it was under construction. I'm not thrilled with the new layout but really happy to have it back nonetheless. I'm sure it'll grow on me"
  },
  {
    "date":1520372582234,
    "platform":"google",
    "text":"It was a blast seeing the statue and definitely taking a picture and posting it on Facebook, so all my friends in Tennessee could get too see our statue."
  },
  {
    "date":1520351959915,
    "platform":"google",
    "text":"Crowded"
  },
  {
    "date":1520446869341,
    "platform":"google",
    "text":"They changed the LOVE TO AMOR,  LOVE IT!!!"
  },
  {
    "date":1520457835092,
    "platform":"google",
    "text":"Love parks open but it looks alot more boreing"
  },
  {
    "date":1520425006795,
    "platform":"google",
    "text":"Newly renovated.... should be a sight to see once spring breaks"
  },
  {
    "date":1520404309404,
    "platform":"google",
    "text":"It's been a while since I been down there but I did walk past doing my super bowl champions parade though 👍👍👌🏆"
  },
  {
    "date":1520389881178,
    "platform":"google",
    "text":"Central City Philadelphia public park and recreational area."
  },
  {
    "date":1520458736473,
    "platform":"google",
    "text":"(Translated by Google) Its appeal is the love sign\n\n(Original)\nSu atractivo es el rótulo love"
  },
  {
    "date":1520527574289,
    "platform":"google",
    "text":"So, when you're in Philly, there are a few \"touristy\" stuff you have to do, and don't try to tell me that you don't want to join in on the line of folks waiting for the perfect spot to get their Love sign photo, because you do, and you will.\n\nLove Park, and the Love sign is synonymous with Philly, and is at center city near City Hall. It is such a gorgeous area and in the summer, it's also nice to sit on the side and dip your feet into the fountain. When the wind blows, the spray from the fountain blows on you and it feels amazing.\n\nThere are tons of what seem to be really nice people offering to take your photo for you, but just stand back and watch what happens after they seem to be so nice in doing so...they then demand money from the folks who just got their pic taken. Don't ask, or agree for strangers to take your pic. They want money. Take your own, it's cuter that way anyway!\n\nIt can be a sketchy place at night, so be sure to stick with the daytime visiting."
  },
  {
    "date":1520514437678,
    "platform":"google",
    "text":"Wonderful"
  },
  {
    "date":1520596192805,
    "platform":"google",
    "text":"Still under construction. The new design isn't all that impressive."
  },
  {
    "date":1520694063608,
    "platform":"google",
    "text":"Can't locate, sign is posted after you pass entrance, can't get out, very poorly marked, choose another parking garage"
  },
  {
    "date":1520805517897,
    "platform":"google",
    "text":"(Translated by Google) Beautiful city!\n\n(Original)\nHermosa ciudad!"
  },
  {
    "date":1520909434858,
    "platform":"google",
    "text":"It was beautiful, the water so refreshing. Couples everywhere... lovely place to propose to the love of your life. ❤💍"
  },
  {
    "date":1520986415569,
    "platform":"google",
    "text":"Great scenery of the city, great walk and a lot of nearby restaurants.  Great place for taking pictures."
  },
  {
    "date":1521047920400,
    "platform":"google",
    "text":"(Translated by Google) Incredible place\n\n(Original)\nIncreíble lugar"
  },
  {
    "date":1521113340263,
    "platform":"google",
    "text":"It was better before they made the change."
  },
  {
    "date":1521204954288,
    "platform":"google",
    "text":"The city rebuilt the park. Made very user unfriendly !!! Miss the old park. City Made it so homeless people can not sleep there etc. No place to really sit eat lunch or have family fun. Just a walk threw now. It's all empty. I'm really disturbed this is what my tax dollars paid for again. 3 rd time city did a do over for the park. Water spout and fountain is gone also. No trees to block the sun and look like an actual park."
  },
  {
    "date":1521184769582,
    "platform":"google",
    "text":"Beautiful place to spend evenings. Parking available on street, free after 10 and Sundays."
  },
  {
    "date":1521248675987,
    "platform":"google",
    "text":"Homeless people? What homeless people? I didn't even see any last time I was there for the Philadelphia Christmas Market. It was a very pleasant time, with McDonald's-ified versions of many international treats like traditionallike french crêpes,  authentish döner kebabs, reheated belgee-I-wish-the-employee-working-the-stand-gave-a-flying-fig-an waffles (AKA liege-ish waffles), and hot $5 cocoa to wash it all down.\n\nEven with the cheesy knock-off versions of the aforementioned foods, the market does offer legitimate German-made traditional Christmas items. Principal among them are the Weihnachtspyramide (Christmas pyramids with the vanes on top that spin if you light candles below), Schwibbögen (hand-carved Christmas arches), and Räuchermannl (wooden figures that appear to be smoking pipes when you burn an incense cone in their  bellies). Several of the event staff are actually German, and speak German, which is very refreshing to hear.\n\nThe park itself has undergone significant renovation, including removal of the fountain. I can't guarantee that you will not not be unaccosted by people who make this park tbeir semi-permanent residence, but go check it out anyway; it's worth a gander. Just don't go alone at night. It can get a wee bit less than comfortable if you're not used to dealing with the kids of folks you find out on the streets at times of day or  night, when those who are fortunate have homes are aldeady inside, battened down for the night. Just bring a few friends along, and you should have a fine time. :-)\n\nAlso, it's fun to go around the corner, & visot the giant clothes-pin. And don't drive, there's practically nowhere to park close by, unless you want to pay..."
  },
  {
    "date":1521281737668,
    "platform":"google",
    "text":"Just got to see it,went to the world champs parade.EAGLES"
  },
  {
    "date":1521252729186,
    "platform":"google",
    "text":"Is good"
  },
  {
    "date":1521391223750,
    "platform":"google",
    "text":"Everyone was hugging and kissing and taking pictures. Very nice."
  },
  {
    "date":1521487476154,
    "platform":"google",
    "text":"I was super excited to go and visit this \"famous LOVE\" sign and park in the middle of Philadelphia downtown but was shocked when I saw it's actual size, it's not something like the cloud gate of chicago or cube in NYC, it's much smaller. and there isn't a park around it per se. One can definitely visit it if in downtown, but not worth making a separate trip of it."
  },
  {
    "date":1521493304628,
    "platform":"google",
    "text":"Not what I was expecting"
  },
  {
    "date":1521582722507,
    "platform":"google",
    "text":"Will be great once construction is done"
  },
  {
    "date":1521748165979,
    "platform":"google",
    "text":"Philadelphia Eagles championship parade. Super Bowl champs 2018. Need I say anymore🦅🏈👏🏽👏🏽👏🏽🏆"
  },
  {
    "date":1521892169122,
    "platform":"google",
    "text":"(Translated by Google) Fun\n\n(Original)\nDivertido"
  },
  {
    "date":1522010302348,
    "platform":"google",
    "text":"Nice place."
  },
  {
    "date":1522102906605,
    "platform":"google",
    "text":"Come and visit"
  },
  {
    "date":1522125725240,
    "platform":"google",
    "text":"Its a nice place. To visit wen the weather warm"
  },
  {
    "date":1522267103467,
    "platform":"google",
    "text":"Great place to be in summer days"
  },
  {
    "date":1522358106441,
    "platform":"google",
    "text":"So small. I thought this was an actual Park. Disappointed. The only thing to do is take one pic under the love sign. Parking sucks. Don't believe the hype."
  },
  {
    "date":1522338059323,
    "platform":"google",
    "text":"Landmark"
  },
  {
    "date":1522603095405,
    "platform":"google",
    "text":"There's usually something going on here."
  },
  {
    "date":1522638699678,
    "platform":"google",
    "text":"Was better b4 the renovation"
  },
  {
    "date":1522711788749,
    "platform":"google",
    "text":"I don't care for the redesigned park. Of course one must still go there for a photo op."
  },
  {
    "date":1522631741743,
    "platform":"google",
    "text":"(Translated by Google) A must take pictures\n\n(Original)\nEin muss zum Bilder machen"
  },
  {
    "date":1522770190831,
    "platform":"google",
    "text":"Just a big empty city block now. Horrible redesign"
  },
  {
    "date":1522843706598,
    "platform":"google",
    "text":"Great park in every way except for when the local Philadelphia police chase away everyone that is skating, and then in doing so scare away every one else in the process. The police seem to be the local park bullies compared to being the babysitters. I dislike how they work and plan to take action in 2018."
  },
  {
    "date":1522958170107,
    "platform":"google",
    "text":"(Translated by Google) If you like the landscape with big buildings visit it\n\n(Original)\nSi te gusta el paisaje co grandes edificios visitalo"
  },
  {
    "date":1523036058266,
    "platform":"google",
    "text":"It's no longer up do to capitalists"
  },
  {
    "date":1523050906785,
    "platform":"google",
    "text":"The fountain is gone! They shouldn't have gotten rid of it. The place is dull without it!"
  },
  {
    "date":1523101351096,
    "platform":"google",
    "text":"Love it"
  },
  {
    "date":1523160145963,
    "platform":"google",
    "text":"Horrible cement benches to low to the ground for seniors"
  },
  {
    "date":1523216353197,
    "platform":"google",
    "text":"Seemed a temporary installation."
  },
  {
    "date":1523413840038,
    "platform":"google",
    "text":"There for Philly Fashion Week"
  },
  {
    "date":1523480991352,
    "platform":"google",
    "text":"(Translated by Google) A beautiful park in the middle of the city. Surrounded by all the buildings in the city.\nThe LOVE sculpture in John F. Kennedy Square is one of the favorite places to take photos, both for tourists and those who live in Philadelphia.\nSo famous is the statue that the square is commonly called \"LOVE Park\" and most do not know its true name.\nJohn F. Kennedy Plaza was built in 1965 above an underground parking lot and was later expanded with the addition of beautifully curved granite steps and a majestic fountain.\nThe iconic Robert Indiana statue of LOVE was only installed in 1776, during the bicentennial events in 1976, but two years later it was removed. Due to its immense popularity, the sculpture returned to the plaza definitively later.\nAside from being a good place to take photos, near the sculpture is the Fairmount Park Welcome Center and a gift shop.\n\n(Original)\nUn parque precioso en medio de la ciudad. Rodeado por todos los edificios de la ciudad.\nLa escultura LOVE, de la plaza John F. Kennedy, es uno de los lugares preferidos para tomarse fotos, tanto por los turistas como quienes viven en Filadelfia.\nTan famosa es la estatua que la plaza es llamada comúnmente “LOVE Park” y la mayoría desconoce su verdadero nombre.\nLa plaza John F. Kennedy fue construida en 1965 sobre un estacionamiento subterráneo y luego fue ampliada con la adición de escalones de granito bellamente curvados y una majestuosa fuente.\nLa icónica estatua AMOR de Robert Indiana fue instalada recién en 1776, durante los actos del bicentenario en 1976, pero dos años más tarde fue removida. Debido a su inmensa popularidad, la escultura regresó tiempo más tarde a la plaza en forma definitiva.\nAparte de ser un buen lugar para tomar fotos, cerca de la escultura se ubica el Centro de Bienvenida Fairmount Park y una tienda de regalos."
  },
  {
    "date":1523545354933,
    "platform":"google",
    "text":"Under construction"
  },
  {
    "date":1523657501101,
    "platform":"google",
    "text":"Met some lovely people from New Orleans!"
  },
  {
    "date":1523629134473,
    "platform":"google",
    "text":"The food is good"
  },
  {
    "date":1523730671884,
    "platform":"google",
    "text":"Good location, good pricing but no direction on how to use your prepaid voucher. We used the customer service button on the pay machines twice, and after hearing an easy to understand message, wecwere connected with a person who we couldn't understand because of the poor interim sysyem."
  },
  {
    "date":1523678115311,
    "platform":"google",
    "text":"Nice place to take pictures."
  },
  {
    "date":1523730211665,
    "platform":"google",
    "text":"Nice spot on vacation"
  },
  {
    "date":1523737646151,
    "platform":"google",
    "text":"Very nice place to visit"
  },
  {
    "date":1523733816036,
    "platform":"google",
    "text":"Public park"
  },
  {
    "date":1523775455108,
    "platform":"google",
    "text":"I  enjoy the place"
  },
  {
    "date":1523875157269,
    "platform":"google",
    "text":"Nice warm day to take iconic LOVE photo with a friend!"
  },
  {
    "date":1523840391259,
    "platform":"google",
    "text":"Love park is beautiful!"
  },
  {
    "date":1524023266608,
    "platform":"google",
    "text":"New and improved and not an eyesore anymore.💗"
  },
  {
    "date":1524023200920,
    "platform":"google",
    "text":"A Philly landmark"
  },
  {
    "date":1524103185401,
    "platform":"google",
    "text":"Fun"
  },
  {
    "date":1524171306421,
    "platform":"google",
    "text":"It's one Philly many to visited. You walk around and see some of other attractions within Center City."
  },
  {
    "date":1524200368729,
    "platform":"google",
    "text":"Philadelphia nice city ))"
  },
  {
    "date":1524493462355,
    "platform":"google",
    "text":"Just plain beautiful."
  },
  {
    "date":1524513479088,
    "platform":"google",
    "text":"(Translated by Google) Fun\n\n(Original)\nDivertido"
  },
  {
    "date":1524576366161,
    "platform":"google",
    "text":"Don't like the new construction. Not enough green space. Looking forward to seeing the fountain once it's up and running. Maybe I will like it better then."
  },
  {
    "date":1524589948874,
    "platform":"google",
    "text":"Not much to do when it's cold. When the fountain will be turned on, it will be more fun."
  },
  {
    "date":1524580882823,
    "platform":"google",
    "text":"It's great"
  },
  {
    "date":1524661697553,
    "platform":"google",
    "text":"It's a nice place for a photo opt"
  },
  {
    "date":1524700494125,
    "platform":"google",
    "text":"Good one"
  },
  {
    "date":1524762492930,
    "platform":"google",
    "text":"Great location for a \"Philly Photo\"! It may be a little line but it's good to have someone to take a picture of the entire group, if you ask politely of course."
  },
  {
    "date":1524776688980,
    "platform":"google",
    "text":"What a beautiful city."
  },
  {
    "date":1524784859834,
    "platform":"google",
    "text":"Great time"
  },
  {
    "date":1524868842638,
    "platform":"google",
    "text":"Small open park designed around the Love statue. Not much to do except relax."
  },
  {
    "date":1525038095071,
    "platform":"google",
    "text":"A centrally located park with Robert Indiana’s Love sculpture as the main focus. The area is great for people watching and taking photos."
  },
  {
    "date":1525122351539,
    "platform":"google",
    "text":"I got propose there on Valentine's day"
  },
  {
    "date":1525057684512,
    "platform":"google",
    "text":"Must see if you have time. Great view of the Parkway and City Hall"
  },
  {
    "date":1525129090605,
    "platform":"google",
    "text":"Ok"
  },
  {
    "date":1525050702269,
    "platform":"google",
    "text":"Is beautiful"
  },
  {
    "date":1525215857582,
    "platform":"google",
    "text":"Great Christmas Market."
  },
  {
    "date":1525140671269,
    "platform":"google",
    "text":"They have red chairs and tables to take a rest and view the city movement. Also a space with lawn and some little trees. The famous \"Love\" inscription is on one of the park's corner, you should probably take a photo there :) it's a well located place to take some rest."
  },
  {
    "date":1525210161756,
    "platform":"google",
    "text":"Visited during annual Philly science fest.\nMust visit to click pics..."
  },
  {
    "date":1525176115132,
    "platform":"google",
    "text":"Very sweet place 💕💕💕"
  },
  {
    "date":1525240119059,
    "platform":"google",
    "text":"Nice but no parking for a quick picture"
  },
  {
    "date":1525303559993,
    "platform":"google",
    "text":"Love Park is awesome, y'all have a good time."
  },
  {
    "date":1525295337721,
    "platform":"google",
    "text":"Nothing there to see except a small love sign very overrated"
  },
  {
    "date":1525288055506,
    "platform":"google",
    "text":"(Translated by Google) Magnificent\n\n(Original)\nMagnifico"
  },
  {
    "date":1525344875171,
    "platform":"google",
    "text":"Used to go here as a teen when it looked different. Nice park."
  },
  {
    "date":1525316805506,
    "platform":"google",
    "text":"A beautiful space!!!"
  },
  {
    "date":1525448991470,
    "platform":"google",
    "text":"Best skate spot! Should've kept skateboarding legal!"
  },
  {
    "date":1525504027275,
    "platform":"google",
    "text":"Recently renovated the famous LOVE sign.. they did an awesome job, it looks brand new! They didn't put the fountain back. I used to love taking pictures at the fountain. They keep up with the cleaning and keeping the homeless from setting up there. Of course everyone is happy the famous sign is back so they can take their pics! No trip to Philly is complete without it!!"
  },
  {
    "date":1525605904408,
    "platform":"google",
    "text":"Nice, vibrant place at the heart of Philly. The city hall and masonic temple are right across the street. The park has the famous 'love' door of Philly. The parking at the love park garage is quite cheap ($10\/24 hours)."
  },
  {
    "date":1525648060842,
    "platform":"google",
    "text":"Renovation in progress !!!"
  },
  {
    "date":1525706054229,
    "platform":"google",
    "text":"Spacious location.. generally lines are there but one can easily get a nice click from a distance. Beautiful location."
  },
  {
    "date":1525702671608,
    "platform":"google",
    "text":"It's a park with a statue that says love, I believe there might be a fountain."
  },
  {
    "date":1525799202753,
    "platform":"google",
    "text":"Just a city park for relax. Not too special. But there are some nice Chinese restaurant in the China Town nearby."
  },
  {
    "date":1525775392809,
    "platform":"google",
    "text":"Nice place to go for a walk, take pictures and walk around!"
  },
  {
    "date":1525767710938,
    "platform":"google",
    "text":"Love it great experience"
  },
  {
    "date":1525876068453,
    "platform":"google",
    "text":"LOVE THIS PLACE. MY WIFE & I COME BY OFTEN TO GET NEW PHOTOS TOGETHER."
  },
  {
    "date":1525979741779,
    "platform":"google",
    "text":"ahahahaha, love park is lovely~~"
  },
  {
    "date":1525974417411,
    "platform":"google",
    "text":"Cool place for pictures!"
  },
  {
    "date":1525910890572,
    "platform":"google",
    "text":"It's a great place"
  },
  {
    "date":1526042204599,
    "platform":"google",
    "text":"Nice clean and very friendly."
  },
  {
    "date":1526155653263,
    "platform":"google",
    "text":"Great little stop for tourists to grab a photo. Good view of city hall as well."
  },
  {
    "date":1526084344094,
    "platform":"google",
    "text":"Here for Xmas festival;. Really fun!"
  },
  {
    "date":1526097237625,
    "platform":"google",
    "text":"This is a bleak replacement for what was here before. The Love sculpture deserves better."
  },
  {
    "date":1526132500625,
    "platform":"google",
    "text":"New and renovated its beautiful"
  },
  {
    "date":1526141174440,
    "platform":"google",
    "text":"Great place to visit"
  },
  {
    "date":1526312849864,
    "platform":"google",
    "text":"Love the updated park and sign"
  },
  {
    "date":1526315086095,
    "platform":"google",
    "text":"Love this place."
  },
  {
    "date":1526293710007,
    "platform":"google",
    "text":"Not as much seating as before"
  },
  {
    "date":1526397792772,
    "platform":"google",
    "text":"It's beautiful and a nice piece of history within the city. Great place to come chill out or take photos with friends and family."
  },
  {
    "date":1526350654460,
    "platform":"google",
    "text":"Isn't as busy since they probably just re-opened?\n\nDon't know what the vibe was like before the renovation however there seems to be an excess of concrete, despite that there's lots of space to sit, relax, read a book, take calls and take in the sights."
  },
  {
    "date":1526586732062,
    "platform":"google",
    "text":"Interesting art surrounding the Philadelphia water department"
  },
  {
    "date":1526592843197,
    "platform":"google",
    "text":"Must visit"
  },
  {
    "date":1526577462180,
    "platform":"google",
    "text":"needs to be power washed but nice"
  },
  {
    "date":1526588939161,
    "platform":"google",
    "text":"If in Love a must"
  },
  {
    "date":1526607417795,
    "platform":"google",
    "text":"A+++"
  },
  {
    "date":1526694881736,
    "platform":"google",
    "text":"New site"
  },
  {
    "date":1526819834621,
    "platform":"google",
    "text":"Was ok.....i love the food their"
  },
  {
    "date":1526784671276,
    "platform":"google",
    "text":"Nice park"
  },
  {
    "date":1526857880552,
    "platform":"google",
    "text":"(Translated by Google) Beautiful place, a must see in Philadelphia.\n\n(Original)\nHermoso lugar, un imperdible de Filadelfia."
  },
  {
    "date":1526940220006,
    "platform":"google",
    "text":"It's a park. It has benches. Always a line of people taking pictures of the LOVE."
  },
  {
    "date":1526935417858,
    "platform":"google",
    "text":"Love it"
  },
  {
    "date":1527000979365,
    "platform":"google",
    "text":"The old Love Park was so much better in every way. This new rendition is boring and uninspired. Not even worth visiting!"
  },
  {
    "date":1527028355505,
    "platform":"google",
    "text":"They redone the park and it looks good"
  },
  {
    "date":1526989412079,
    "platform":"google",
    "text":"Excellent condition for a park in the heart of the City!!!"
  },
  {
    "date":1527018780993,
    "platform":"google",
    "text":"Center City Park. Lots of things to see and do nearby."
  },
  {
    "date":1527027277819,
    "platform":"google",
    "text":"Great remodel"
  },
  {
    "date":1527084964701,
    "platform":"google",
    "text":"Amazing, they are doing some construction on new additions currently"
  },
  {
    "date":1527103980309,
    "platform":"google",
    "text":"I wish the fountain was still there! !"
  },
  {
    "date":1527114076993,
    "platform":"google",
    "text":"Beautifully renovated!"
  },
  {
    "date":1527092485029,
    "platform":"google",
    "text":"24 hours a day"
  },
  {
    "date":1527123839243,
    "platform":"google",
    "text":"Tourist trap. I miss the fountain,  but it's a nice urban space."
  },
  {
    "date":1527247098891,
    "platform":"google",
    "text":"It's nice they have removed the fountain,but added a lot of open space"
  },
  {
    "date":1527220515025,
    "platform":"google",
    "text":"So many new features added to love park & this summer it will show"
  },
  {
    "date":1527209381826,
    "platform":"google",
    "text":"Different"
  },
  {
    "date":1527331019756,
    "platform":"google",
    "text":"The recent redesign is great. Maybe once they finish the new fountain it will be a 4 or 5 star park."
  },
  {
    "date":1527343424236,
    "platform":"google",
    "text":"Love the park but I work near here so not as exciting most days. They need to bring the fountain back or a version of it."
  },
  {
    "date":1527363200605,
    "platform":"google",
    "text":"Yes, fun for tourism. Especially memorial day weekend!"
  },
  {
    "date":1527370324255,
    "platform":"google",
    "text":"No ramp for wheel chair"
  },
  {
    "date":1527351181742,
    "platform":"google",
    "text":"No shade. Fountain doesn't work. I miss the old one."
  },
  {
    "date":1527446025206,
    "platform":"google",
    "text":"One of the most iconic places of Philly!"
  },
  {
    "date":1527387335832,
    "platform":"google",
    "text":"Beautiful and peaceful"
  },
  {
    "date":1527478466694,
    "platform":"google",
    "text":"Beautiful city very quiet and very historical it's an honor to be both born and raised in that City"
  },
  {
    "date":1527632647967,
    "platform":"google",
    "text":"very scenic park. This is just a Philadelphia!!"
  },
  {
    "date":1527603509882,
    "platform":"google",
    "text":"Did not visit Love Park."
  },
  {
    "date":1527562523315,
    "platform":"google",
    "text":"Beautiful Place"
  },
  {
    "date":1527557072407,
    "platform":"google",
    "text":"(Translated by Google) Fun\n\n(Original)\nLeuk"
  },
  {
    "date":1527724138331,
    "platform":"google",
    "text":"It is ridiculous I don't like it or what it stands for... it is the city's way of making homeless people more uncomfortable"
  },
  {
    "date":1527693406200,
    "platform":"google",
    "text":"Loving the event that's going on"
  },
  {
    "date":1527696392686,
    "platform":"google",
    "text":"Wonderful"
  }
]